#include <iostream>

int main() {
    int m, n; //переменная

    // Запитуємо у користувача введення розмірів прямокутника
    std::cout << "рядки(m): ";
    std::cin >> m;
    
    std::cout << "столбцы (n): ";
    std::cin >> n;

    // Виводимо прямокутник розміром m на n
    for (int i = 0; i < m; i++) { //i++ как в питончике i += 1 . Цыклируем рядки i - счетчик циклов. 
        for (int j = 0; j < n; j++) { //циклируем стобики
            std::cout << "*";
        }
        std::cout << std::endl; // Переходим на новый рядок
    }

    return 0;
}
